import pandas as pd 

naams = pd.read_csv('naamapadaani_responses.csv')
print(naams.columns)

for index, row in naams.iterrows():
    if row.iloc[3] == 'स्त्रिलिङ्ग':
        linga = 'स्त्री'
    if row.iloc[3] == 'पुल्लिङ्ग':
        linga = 'पु'
    if row.iloc[3] == 'नपुंसकलिङ्ग':
        linga = 'न'
    print("nouns['",row.iloc[2]," (",linga,")'] = '",'#'.join(row.iloc[4:]),"'",sep="")

# nouns['माला (स्त्रि)'] = 'माला#माले#मालाः#माले#माले#मालाः#मालाम्#माले#मालाः#मालया#मालाभ्याम्#मालाभिः#मालायै#मालाभ्याम्#मालाभ्यः#मालायाः#मालाभ्याम्#मालाभ्यः#मालायाः#मालयोः#मालानाम्#मालायाम्#मालयोः#मालासु'
# nouns['देव (पु)'] = 'देवः#देवौ#देवाः#देव#देवौ#देवाः#देवम्#देवौ#देवान्#देवेन#देवाभ्याम्#देवैः#देवाय#देवाभ्याम्#देवेभ्यः#देवात्#देवाभ्याम्#देवेभ्यः#देवस्य#देवयोः#देवानाम्#देवे#देवयोः#देवेषु'
# nouns['मुनि (पु)'] = 'मुनिः#मुनी#मुनयः#मुने#मुनी#मुनयः#मुनिम्#मुनी#मुनीन्#मुनिना#मुनिभ्याम्#मुनिभिः#मुनये#मुनिभ्याम्#मुनिभ्यः#मुनेः#मुनिभ्याम्#मुनिभ्यः#मुनेः#मुन्योः#मुनीनाम्#मुनौ#मुन्योः#मुनिषु'
# nouns['रात्रि (स्त्रि)'] = 'रात्रिः#रात्री#रात्रयः#रात्रे#रात्रे#रात्रयः#रात्रिम्#रात्री#रात्रीः#रात्र्या#रात्रिभ्याम्#रात्रिभिः#रात्र्यै#रात्रिभ्याम्#रात्रिभ्यः#रात्र्याः#रात्रिभ्याम्#रात्रिभ्यः#रात्र्याः#रात्र्योः#रात्रीणाम्#रात्र्याम्#रात्र्योः#रात्रिषु'
# nouns['नगरी (स्त्रि)'] = 'नगरी#नगर्यौ#नगर्यः#नगरि#नगर्यौ#नगर्यः#नगरीम्#नगर्यौ#नगरीः#नगर्या#नगरीभ्याम्#नगरीभिः#नगर्यै#नगरीभ्याम्#नगरीभ्यः#नगर्याः#नगरीभ्याम्#नगरीभ्यः#नगर्याः#नगर्योः#नगरीणाम्#नगर्याम्#नगर्योः#नगरीषु'
# nouns['भानु (पु)'] = 'भानुः#भानू#भानवः#भानो#भानू#भानवः#भानुम्#भानू#भानून्#भानुना#भानुभ्याम्#भानुभिः#भानवे#भानुभ्याम्#भानुभ्यः#भानोः#भानुभ्याम्#भानुभ्यः#भानोः#भान्वोः#भानूनाम्#भानौ#भान्वोः#भानुषु'
# nouns['नेतृ (पु)'] = 'नेता#नेतारौ#नेतारः#नेतः#नेतारौ#नेतारः#नेतारम्#नेतारौ#नेतॄन्#नेत्रा#नेतृभ्याम्#नेतृभिः#नेत्रे#नेतृभ्याम्#नेतृभ्यः#नेतुः#नेतृभ्याम्#नेतृभ्यः#नेतुः#नेत्रोः#नेतॄणाम्#नेतरि#नेत्रोः#नेतृषु'
# nouns['पति (पु)'] = 'पतिः#पती#पतयः#पते#पती#पतयः#पतिम्#पती#पतीन्#पत्या#पतिभ्याम्#पतिभिः#पत्ये#पतिभ्याम्#पतिभ्यः#पत्युः#पतिभ्याम्#पतिभ्यः#पत्युः#पत्योः#पतीनाम्#पत्यौ#पत्योः#पतिषु'
# nouns['धेनु (स्त्रि)'] = 'धेनुः#धेनू#धेनवः#धेनो#धेनू#धेनवः#धेनुम्#धेनू#धेनूः#धेन्वा#धेनुभ्याम्#धेनुभिः#धेन्वै#धेनुभ्याम्#धेनुभ्यः#धेन्वाः#धेनुभ्याम्#धेनुभ्यः#धेन्वाः#धेन्वोः#धेनूनाम्#धेन्वाम्#धेन्वोः#धेनुषु'
